input = [4, 6, 2, 9, 1]

#버블 정렬
# [4, 6, 2, 9, 1]
# 4 < 6 : 그대로 [4, 6, 2, 9, 1]
# 6 > 2 : 교환  [4, 2, 6, 9, 1]
# 6 < 9 : 그대로 [4, 2, 6, 9, 1]
# 9 > 1 : 교환 [4, 2, 6, 1, 9]

# 맨 뒤에 제외 다시 반복
# 4 > 2 : 교환 [2, 4, 6, 1, 9]
# 4 < 6 : 그대로 [2, 4, 6, 1, 9]
# 6 > 1 : 교환 [2, 4, 1, 6, 9]

# 맨 뒤에 제외 다시 반복
# 2 < 4 : 그대로 [2, 4, 1, 6, 9]
# 4 > 1 : 교환 [2, 1, 4, 6, 9]

# 맨 뒤에 제외 다시 반복
# 2 > 1 : 교환 [1, 2, 4, 6, 9]

# 버블 정렬
# O(N제곱)
def bubble_sort(array):
    n = len(array)
    for i in range(n - 1):
        for j in range(n - i - 1):
            if array[j] > array[j+1]:
                array[j], array[j+1] = array[j+1], array[j]

    return array


bubble_sort(input)
print(input)  # [1, 2, 4, 6, 9] 가 되어야 합니다!